#ifndef  __CONFIG_H__
#define  __CONFIG_H__

//无符号类型的定义

	
//----------------------------------------


//全局宏定义

//----------------------------------------


//全局类型定义
typedef enum{FALSE = 0, TRUE = !FALSE}BOOL;

//-------------------------------------


#ifdef MAIN_CONFIG  //头文件被多个C调用时，避免变量冲突问题
	#define EXT
#else 
	#define EXT extern
#endif
	
	
//-------------------------------------
	
//常用头文件包含
#include "stm32f1xx.h"  //芯片基础头文件
#include "stdio.h"
#include "string.h"
#include "math.h"
#include <stdarg.h> 
#include <stdbool.h>
#include <stdlib.h>
	
//-------------------------------------
	
//外设驱动头文件包含
#include "system.h"  //系统相关头文件
	
//----------------------------------------
//全局变量定义,请使用EXT修饰
EXT unsigned char g_Var;	

//----------------------------------------	
#endif

/********************************************************************************************************
**                            End Of File
********************************************************************************************************/
